MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ramcfg.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_ramcfg.c
  * @brief   This file provides firmware functions to manage the functionality
  *          of the RAM configuration controller peripheral.
  **********************************************************************************************************************
    * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"
/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined (RAMCFG_SRAM1) || defined (RAMCFG_SRAM2)
#if defined (USE_HAL_RAMCFG_MODULE) && (USE_HAL_RAMCFG_MODULE == 1)

/** @addtogroup RAMCFG
  * @brief RAMCFG HAL module driver.
  * @{
  */

/** @defgroup RAMCFG_Introduction RAMCFG Introduction
  * @{

  The RAMCFG hardware abstraction layer provides a set of APIs to interface with the RAMCFG peripheral controlling the
  internal SRAMs configuration on STM32 microcontrollers.

  The RAMCFG module provides firmware functions to manage the following functionalities :
  - ECC management functions.
  - SRAM write protection management functions.
  - SRAM erase management functions.
  - SRAM information getter functions.

  This abstraction layer guarantees portability and ease of use across different STM32 series.
  */

/**
  * @}
  */

/** @defgroup RAMCFG_How_To_Use RAMCFG How To Use
  * @{

# How to use the RAMCFG HAL module driver

This module provides a set of APIs to manage each feature supported by the internal SRAMs:

1. ECC feature

  - This feature is supported by SRAM2. ECC monitoring supports the single error detection and correction and
    double error detection.

  - Use the HAL_RAMCFG_ECC_Enable() function to enable the RAMCFG ECC monitoring process in silent mode, i.e. no
    interrupt will be triggered, nor will a callback be sent upon an ECC error. User must rely on
    HAL_RAMCFG_ECC_GetInfo() function to monitor or/and check for ECC errors if any.

  - Use the HAL_RAMCFG_ECC_Enable_IT() function to start ECC error monitoring process in interrupt mode and to activate
    the latching error address. The following interrupts will be enabled and user will receive a dedicated callback
    upon an ECC error :
    - Single error interrupt,
    - Double error interrupt,
    - Double error interrupt redirected to Non-Maskable Interrupt(NMI).

    If an interrupt occurs on the RAMCFG line, user can call the HAL_RAMCFG_IRQHandler() function to manage the
    interrupt for a given instance.

    If the double error interrupt is redirected to NMI, user can call the HAL_RAMCFG_NMI_IRQHandler() function to manage
    the RAMCFG NMI interrupt for a given instance.

  - Use the HAL_RAMCFG_ECC_GetInfo() function to get the type, status and address of the last ECC error detected.
    The type can be :
    - No ECC error detected,
    - Single error,
    - Double error.
    The status can be :
    - ECC error not corrected,
    - ECC error corrected.

  - Use the HAL_RAMCFG_ECC_Disable() function to disable the RAMCFG ECC monitoring.

2. Write protection feature
  - This feature is supported by SRAM2.
    The SRAM1 is divided to 64 pages and SRAM2 to 64 pages with 1 KB granularity.
    Each page can be write protected independently.

  - Use the HAL_RAMCFG_EnablePageWRP() function to set the write protection for the given SRAM page(s).

  - Use the HAL_RAMCFG_EnableWRPByAddr() function to set the write protection for the given SRAM with start address
    and number of bytes.

  - Use the HAL_RAMCFG_IsEnabledPageWRP() function to check the write protection status of a page of the SRAM.

  - Use the HAL_RAMCFG_IsEnabledWRPByAddr() function to check the write protection status of a SRAM address.

  - There is no API to disable write protection as this feature can only be disabled by a global peripheral reset
    or system reset.

  - Any write access to a write protected area of the given SRAM causes a HardFault interrupt.

3. Erase feature
  - Each SRAM can be erased independently through its RAMCFG instance.

  - After a complete hardware erase, the given SRAM is set to 0 value.

  - Use the HAL_RAMCFG_MassErase() function to launch a hardware erase for the given SRAM.

4. SRAM information getter
  - Use the HAL_RAMCFG_GetLLInstance() function to get the selected RAMCFG hardware instance.

  - Use the HAL_RAMCFG_GetSRAMBaseAddress() function to get the selected RAMCFG SRAM base address.

  - Use the HAL_RAMCFG_GetSRAMSize() function to get the selected RAMCFG SRAM size.
  */
/**
  * @}
  */

/** @defgroup RAMCFG_Configuration_Table RAMCFG Configuration Table
  * @{
# Configuration inside the RAMCFG driver

Config defines                    | Description      | Default value     | Note
--------------------------------- | ---------------- | ----------------- | --------------------------------------
PRODUCT                           | from IDE         | NA                | Ex:STM32C562XX.
USE_ASSERT_DBG_PARAM              | from IDE         | None              | Enable the parameters asserts.
USE_HAL_CHECK_PARAM               | from hal_conf.h  | 0                 | Enable the parameters runtime checks.
USE_HAL_RAMCFG_MODULE             | from hal_conf.h  | 1                 | Enable the HAL RAMCFG module.
  */
/**
  * @}
  */

/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private constants -------------------------------------------------------------------------------------------------*/

/** @defgroup RAMCFG_Private_Constants RAMCFG Private Constants
  * @{
  */

/*! RAMCFG page size value */
#define RAMCFG_PAGE_SIZE     0x400U
/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup RAMCFG_Private_Macros RAMCFG Private Macros
  * @{
  */

/*! Get RAMCFG instance */
#define RAMCFG_GET_INSTANCE(instance) ((RAMCFG_TypeDef *)((uint32_t)(instance)))

/*! Macro to get the base address of the given SRAM */
#define RAMCFG_GET_SRAM_BASE_ADDR(instance) (((instance) == HAL_RAMCFG_SRAM1) ? SRAM1_BASE : SRAM2_BASE)

/*! Macro to get size of the given SRAM */
#define RAMCFG_GET_SRAM_SIZE_BYTE(instance) (((instance) == HAL_RAMCFG_SRAM1) ? SRAM1_SIZE : SRAM2_SIZE)

/*! Macro to check all interrupts */
#define IS_RAMCFG_ECC_INTERRUPT(interrupt) \
  ((((interrupt) & (HAL_RAMCFG_IT_ECC_SINGLE | HAL_RAMCFG_IT_ECC_DOUBLE | HAL_RAMCFG_IT_ECC_DOUBLE_NMI)) != 0U) \
   && (((interrupt) & ~(HAL_RAMCFG_IT_ECC_SINGLE | HAL_RAMCFG_IT_ECC_DOUBLE | HAL_RAMCFG_IT_ECC_DOUBLE_NMI)) == 0U))

/*! Macro to check parameters in range of the given SRAM */
#define IS_RAMCFG_WP_IN_RANGE(offset, size, sram_size) (((offset) + (size)) <= sram_size)

/*! Macro to check write protection granularity */
#define IS_RAMCFG_WP_GRANULARITY(addr, size, sram_size) (((((addr) - sram_size) % RAMCFG_PAGE_SIZE) == 0U) \
                                                         && (((size) % RAMCFG_PAGE_SIZE) == 0U))

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/

