MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ramcfg.c
/** @addtogroup RAMCFG_Exported_Functions
  * @{
  */

/** @addtogroup RAMCFG_Exported_Functions_Group1
  * @{
This section provides functions to manage the ECC feature provided by the RAMCFG peripheral.

- Call the function HAL_RAMCFG_ECC_Enable() to enable the ECC error monitoring process and latch the error address
 in silent mode.

- Call the function HAL_RAMCFG_ECC_Enable_IT() to enable the ECC error monitoring process and latch the error address
 in interrupt mode (only interrupts specified in the dedicated function parameter are enabled).

- Call the function HAL_RAMCFG_ECC_Disable() to disable and stop ECC monitoring for the selected RAMCFG instance.

- Call the function HAL_RAMCFG_ECC_GetInfo() to get the RAMCFG ECC information.
  */

/**
  * @brief  Enable ECC monitoring with error address latching for the given RAMCFG instance.
  * @param  instance RAMCFG instance.
  * @retval HAL_OK ECC monitoring enabled successfully.
  */
hal_status_t HAL_RAMCFG_ECC_Enable(hal_ramcfg_t instance)
{
  ASSERT_DBG_PARAM(IS_RAMCFG_ECC_INSTANCE(RAMCFG_GET_INSTANCE(instance)));

  LL_RAMCFG_EnableECC(RAMCFG_GET_INSTANCE(instance));

  return HAL_OK;
}

/**
  * @brief  Enable ECC monitoring with error address latching and given interrupt(s) for the given RAMCFG instance.
  * @param  instance RAMCFG instance.
  * @param  interrupt Interrupt(s) to be enabled.
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref HAL_RAMCFG_IT_ECC_SINGLE
  *         @arg @ref HAL_RAMCFG_IT_ECC_DOUBLE
  *         @arg @ref HAL_RAMCFG_IT_ECC_DOUBLE_NMI
  * @retval HAL_OK ECC monitoring enabled successfully.
  */
hal_status_t HAL_RAMCFG_ECC_Enable_IT(hal_ramcfg_t instance, uint32_t interrupt)
{
  ASSERT_DBG_PARAM(IS_RAMCFG_ECC_INSTANCE(RAMCFG_GET_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_RAMCFG_ECC_INTERRUPT(interrupt));

  LL_RAMCFG_ClearFlag(RAMCFG_GET_INSTANCE(instance), LL_RAMCFG_FLAG_ECC_ALL);
  LL_RAMCFG_EnableIT(RAMCFG_GET_INSTANCE(instance), interrupt);
  LL_RAMCFG_EnableECC(RAMCFG_GET_INSTANCE(instance));

  return HAL_OK;
}

/**
  * @brief  Disable ECC monitoring for the given RAMCFG instance.
  * @param  instance RAMCFG instance.
  * @retval HAL_OK ECC monitoring disabled successfully.
  */
hal_status_t HAL_RAMCFG_ECC_Disable(hal_ramcfg_t instance)
{
  ASSERT_DBG_PARAM(IS_RAMCFG_ECC_INSTANCE(RAMCFG_GET_INSTANCE(instance)));

  LL_RAMCFG_SetECCKey(RAMCFG_GET_INSTANCE(instance), (uint32_t)LL_RAMCFG_ECC_KEY_1);
  LL_RAMCFG_SetECCKey(RAMCFG_GET_INSTANCE(instance), (uint32_t)LL_RAMCFG_ECC_KEY_2);
  LL_RAMCFG_DisableECC(RAMCFG_GET_INSTANCE(instance));
  LL_RAMCFG_DisableIT(RAMCFG_GET_INSTANCE(instance), LL_RAMCFG_IT_ALL);

  return HAL_OK;
}

/**
  * @brief   Get the ECC information.
  * @param   instance RAMCFG instance.
  * @param   p_info Pointer to a \ref hal_ramcfg_ecc_info_t structure.
  */
void HAL_RAMCFG_ECC_GetInfo(hal_ramcfg_t instance, hal_ramcfg_ecc_info_t *p_info)
{
  ASSERT_DBG_PARAM(p_info != NULL);
  ASSERT_DBG_PARAM(IS_RAMCFG_ECC_INSTANCE(RAMCFG_GET_INSTANCE(instance)));

  if (LL_RAMCFG_IsActiveFlag_DED(RAMCFG_GET_INSTANCE(instance)) != 0U)
  {
    p_info->type    = HAL_RAMCFG_ECC_DOUBLE;
    p_info->status  = HAL_RAMCFG_ECC_NOT_CORRECTED;
    p_info->address = LL_RAMCFG_GetECCDoubleErrorAddress(RAMCFG_GET_INSTANCE(instance));
  }
  else if (LL_RAMCFG_IsActiveFlag_SEDC(RAMCFG_GET_INSTANCE(instance)) != 0U)
  {
    p_info->type    = HAL_RAMCFG_ECC_SINGLE;
    p_info->status  = HAL_RAMCFG_ECC_CORRECTED;
    p_info->address = LL_RAMCFG_GetECCSingleErrorAddress(RAMCFG_GET_INSTANCE(instance));
  }
  else
  {
    p_info->type = HAL_RAMCFG_ECC_NONE;
  }
}
/**
  * @}
  */

/** @addtogroup RAMCFG_Exported_Functions_Group3
  * @{
This section provides functions to enable the write protection feature for the page(s) of the given SRAM.
SRAM page protection can be disabled only by a global peripheral reset or a system reset.

- Call the function HAL_RAMCFG_EnablePageWRP() to enable the write protection for the given page(s) of the SRAM.
- Call the function HAL_RAMCFG_EnableWRPByAddr() to enable the write protection for the given SRAM address range.
- Call the function HAL_RAMCFG_IsEnabledPageWRP() to check the write protection status of a page of the SRAM.
- Call the function HAL_RAMCFG_IsEnabledWRPByAddr() to check the write protection status of a SRAM address.

  */

/**
  * @brief  Enable write protection for the given page(s).
  * @param  instance   RAMCFG instance.
  * @param  start_page Select the start page number.
  * @param  page_nbr   Number of pages to be protected.
  * @retval HAL_INVALID_PARAM Invalid parameter when the number of pages to protect is higher than the number of pages
  *                           available for the given SRAM.
  * @retval HAL_OK            RAMCFG pages are successfully protected.
  */
hal_status_t HAL_RAMCFG_EnablePageWRP(hal_ramcfg_t instance, uint32_t start_page, uint32_t page_nbr)
{
  uint32_t page_mask_0 = 0U;
#if defined (LL_RAMCFG_WRP_PAGE_32)
  uint32_t page_mask_1 = 0U;
#endif /* LL_RAMCFG_WRP_PAGE_32 */
#if defined (LL_RAMCFG_WRP_PAGE_64)
  uint32_t page_mask_2 = 0U;
#endif /* LL_RAMCFG_WRP_PAGE_64 */
#if defined (LL_RAMCFG_WRP_PAGE_96)
  uint32_t page_mask_3 = 0U;
#endif /* LL_RAMCFG_WRP_PAGE_96 */

  ASSERT_DBG_PARAM(IS_RAMCFG_WP_INSTANCE(RAMCFG_GET_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_RAMCFG_WP_IN_RANGE((start_page * RAMCFG_PAGE_SIZE), (page_nbr * RAMCFG_PAGE_SIZE),
                                         RAMCFG_GET_SRAM_SIZE_BYTE(instance)));

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((start_page + page_nbr) > (RAMCFG_GET_SRAM_SIZE_BYTE(instance) / RAMCFG_PAGE_SIZE))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Repeat for the page number to be protected. */
  for (uint32_t count = 0U; count < page_nbr; count++)
  {
#if defined (LL_RAMCFG_WRP_PAGE_32)
    if ((start_page + count) < 32U)
    {
#endif /* LL_RAMCFG_WRP_PAGE_32 */
      page_mask_0 |= (1UL << (start_page + count));
#if defined (LL_RAMCFG_WRP_PAGE_32)
    }
#if defined (LL_RAMCFG_WRP_PAGE_96)
    else if ((start_page + count) >= 96U)
    {
      page_mask_3 |= (1UL << ((start_page + count) - 96U));
    }
#endif /* LL_RAMCFG_WRP_PAGE_96 */
#if defined (LL_RAMCFG_WRP_PAGE_64)
    else if ((start_page + count) >= 64U)
    {
      page_mask_2 |= (1UL << ((start_page + count) - 64U));
    }
#endif /* LL_RAMCFG_WRP_PAGE_64 */
    else
    {
      page_mask_1 |= (1UL << ((start_page + count) - 32U));
    }
#endif /* LL_RAMCFG_WRP_PAGE_32 */
  }

