MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ramcfg.c
  LL_RAMCFG_EnablePageWRP_0_31(RAMCFG_GET_INSTANCE(instance), page_mask_0);
#if defined (LL_RAMCFG_WRP_PAGE_32)
  LL_RAMCFG_EnablePageWRP_32_63(RAMCFG_GET_INSTANCE(instance), page_mask_1);
#endif /* LL_RAMCFG_WRP_PAGE_32 */
#if defined (LL_RAMCFG_WRP_PAGE_64)
  LL_RAMCFG_EnablePageWRP_64_95(RAMCFG_GET_INSTANCE(instance), page_mask_2);
#endif /* LL_RAMCFG_WRP_PAGE_64 */
#if defined (LL_RAMCFG_WRP_PAGE_96)
  LL_RAMCFG_EnablePageWRP_96_127(RAMCFG_GET_INSTANCE(instance), page_mask_3);
#endif /* LL_RAMCFG_WRP_PAGE_96 */

  return HAL_OK;
}

/**
  * @brief   Enable write protection for the given SRAM address range.
  * @param   instance  RAMCFG instance.
  * @param   sram_addr Start of the address range to be protected.
  * @param   size_byte Size of address range to be protected (in bytes).
  * @warning Physically, the SRAM protection granularity is a page. When sram_addr does not correspond to the start of
  *          a page and size_byte does not cover an integer number of pages, the driver rounds to the first and last
  *          pages to cover the area defined by sram_addr and size_byte.
  * @retval  HAL_INVALID_PARAM Invalid parameter when sram_addr is not in the range of the given SRAM and the total
  *                            size to be protected is larger than the given SRAM size.
  * @retval  HAL_OK            RAMCFG pages are successfully protected by address.
  */
hal_status_t HAL_RAMCFG_EnableWRPByAddr(hal_ramcfg_t instance,
                                        uint32_t sram_addr,
                                        uint32_t size_byte)
{
  uint32_t page_mask_0 = 0U;
#if defined (LL_RAMCFG_WRP_PAGE_32)
  uint32_t page_mask_1 = 0U;
#endif /* LL_RAMCFG_WRP_PAGE_32 */
#if defined (LL_RAMCFG_WRP_PAGE_64)
  uint32_t page_mask_2 = 0U;
#endif /* LL_RAMCFG_WRP_PAGE_64 */
#if defined (LL_RAMCFG_WRP_PAGE_96)
  uint32_t page_mask_3 = 0U;
#endif /* LL_RAMCFG_WRP_PAGE_96 */
  uint32_t start_page;
  uint32_t page_nbr;

  ASSERT_DBG_PARAM(IS_RAMCFG_WP_INSTANCE(RAMCFG_GET_INSTANCE(instance)));
  ASSERT_DBG_PARAM(RAMCFG_GET_SRAM_BASE_ADDR(instance) <= sram_addr);
  ASSERT_DBG_PARAM(IS_RAMCFG_WP_GRANULARITY(sram_addr, size_byte, RAMCFG_GET_SRAM_SIZE_BYTE(instance)));
  ASSERT_DBG_PARAM(IS_RAMCFG_WP_IN_RANGE((sram_addr - RAMCFG_GET_SRAM_BASE_ADDR(instance)), size_byte,
                                         RAMCFG_GET_SRAM_SIZE_BYTE(instance)));


#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((sram_addr < RAMCFG_GET_SRAM_BASE_ADDR(instance)) \
      || (((sram_addr - RAMCFG_GET_SRAM_BASE_ADDR(instance)) + size_byte) > \
          RAMCFG_GET_SRAM_SIZE_BYTE(instance)))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  start_page = ((sram_addr - RAMCFG_GET_SRAM_BASE_ADDR(instance)) / RAMCFG_PAGE_SIZE);
  page_nbr = (size_byte / RAMCFG_PAGE_SIZE);

  /* Repeat for the page number to be protected. */
  for (uint32_t count = 0U; count < page_nbr; count++)
  {
#if defined (LL_RAMCFG_WRP_PAGE_32)
    if ((start_page + count) < 32U)
    {
#endif /* LL_RAMCFG_WRP_PAGE_32 */
      page_mask_0 |= (1UL << (start_page + count));
#if defined (LL_RAMCFG_WRP_PAGE_32)
    }
#if defined (LL_RAMCFG_WRP_PAGE_96)
    else if ((start_page + count) >= 96U)
    {
      page_mask_3 |= (1UL << ((start_page + count) - 96U));
    }
#endif /* LL_RAMCFG_WRP_PAGE_96 */
#if defined (LL_RAMCFG_WRP_PAGE_64)
    else if ((start_page + count) >= 64U)
    {
      page_mask_2 |= (1UL << ((start_page + count) - 64U));
    }
#endif /* LL_RAMCFG_WRP_PAGE_64 */
    else
    {
      page_mask_1 |= (1UL << ((start_page + count) - 32U));
    }
#endif /* LL_RAMCFG_WRP_PAGE_32 */
  }

  LL_RAMCFG_EnablePageWRP_0_31(RAMCFG_GET_INSTANCE(instance), page_mask_0);
#if defined (LL_RAMCFG_WRP_PAGE_32)
  LL_RAMCFG_EnablePageWRP_32_63(RAMCFG_GET_INSTANCE(instance), page_mask_1);
#endif /* LL_RAMCFG_WRP_PAGE_32 */
#if defined (LL_RAMCFG_WRP_PAGE_64)
  LL_RAMCFG_EnablePageWRP_64_95(RAMCFG_GET_INSTANCE(instance), page_mask_2);
#endif /* LL_RAMCFG_WRP_PAGE_64 */
#if defined (LL_RAMCFG_WRP_PAGE_96)
  LL_RAMCFG_EnablePageWRP_96_127(RAMCFG_GET_INSTANCE(instance), page_mask_3);
#endif /* LL_RAMCFG_WRP_PAGE_96 */
  return HAL_OK;
}

/**
  * @brief  Check the write protection status for the given page.
  * @param  instance RAMCFG instance.
  * @param  page     Select the page index.
  * @retval Return value can be one element of \ref hal_ramcfg_wrp_page_status_t enumeration.
  */
hal_ramcfg_wrp_page_status_t HAL_RAMCFG_IsEnabledPageWRP(hal_ramcfg_t instance, uint32_t page)
{
  uint32_t wrp_status = 0U;

  ASSERT_DBG_PARAM(IS_RAMCFG_WP_INSTANCE(RAMCFG_GET_INSTANCE(instance)));
  ASSERT_DBG_PARAM(IS_RAMCFG_WP_IN_RANGE((page * RAMCFG_PAGE_SIZE), RAMCFG_PAGE_SIZE,
                                         RAMCFG_GET_SRAM_SIZE_BYTE(instance)));

  /* Get the protection status of the given page */
#if defined (LL_RAMCFG_WRP_PAGE_32)
  if (page < 32U)
  {
#endif /* LL_RAMCFG_WRP_PAGE_32 */
    wrp_status = LL_RAMCFG_IsEnabledPageWRP_0_31(RAMCFG_GET_INSTANCE(instance), (1UL << page));
#if defined (LL_RAMCFG_WRP_PAGE_32)
  }
#if defined (LL_RAMCFG_WRP_PAGE_96)
  else if (page >= 96U)
  {
    wrp_status = LL_RAMCFG_IsEnabledPageWRP_96_127(RAMCFG_GET_INSTANCE(instance), (1UL << (page - 96U)));
  }
#endif /* LL_RAMCFG_WRP_PAGE_96 */
#if defined (LL_RAMCFG_WRP_PAGE_64)
  else if (page >= 64U)
  {
    wrp_status = LL_RAMCFG_IsEnabledPageWRP_64_95(RAMCFG_GET_INSTANCE(instance), (1UL << (page - 64U)));
  }
#endif /* LL_RAMCFG_WRP_PAGE_64 */
  else
  {
    wrp_status = LL_RAMCFG_IsEnabledPageWRP_32_63(RAMCFG_GET_INSTANCE(instance), (1UL << (page - 32U)));
  }
#endif /* LL_RAMCFG_WRP_PAGE_32 */

  return ((wrp_status == 0U) ? HAL_RAMCFG_WRP_PAGE_NOT_PROTECTED : HAL_RAMCFG_WRP_PAGE_PROTECTED);
}

/**
  * @brief   Check the write protection status for the given SRAM by address.
  * @param   instance  RAMCFG instance.
  * @param   sram_addr Address to check for protection.
  * @warning Physically, the SRAM protection granularity is a page. When sram_addr does not correspond to the start of
  *          a page, the driver checks the status for the page containing the given sram_addr.
  * @retval  Return value can be one element of \ref hal_ramcfg_wrp_page_status_t enumeration.
  */
hal_ramcfg_wrp_page_status_t HAL_RAMCFG_IsEnabledWRPByAddr(hal_ramcfg_t instance, uint32_t sram_addr)
{
  uint32_t page;
  uint32_t wrp_status;

  ASSERT_DBG_PARAM(IS_RAMCFG_WP_INSTANCE(RAMCFG_GET_INSTANCE(instance)));
  ASSERT_DBG_PARAM(RAMCFG_GET_SRAM_BASE_ADDR(instance) <= sram_addr);
  ASSERT_DBG_PARAM(IS_RAMCFG_WP_GRANULARITY(sram_addr, 0U, RAMCFG_GET_SRAM_SIZE_BYTE(instance)));
  ASSERT_DBG_PARAM(IS_RAMCFG_WP_IN_RANGE((sram_addr - RAMCFG_GET_SRAM_BASE_ADDR(instance)), 0U,
                                         RAMCFG_GET_SRAM_SIZE_BYTE(instance)));

  page = ((sram_addr - RAMCFG_GET_SRAM_BASE_ADDR(instance)) / RAMCFG_PAGE_SIZE);

