MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_ramcfg.c
  /* Get the protection status of the given page */
#if defined (LL_RAMCFG_WRP_PAGE_32)
  if (page < 32U)
  {
#endif /* LL_RAMCFG_WRP_PAGE_32 */
    wrp_status = LL_RAMCFG_IsEnabledPageWRP_0_31(RAMCFG_GET_INSTANCE(instance), (1UL << page));
#if defined (LL_RAMCFG_WRP_PAGE_32)
  }
#if defined (LL_RAMCFG_WRP_PAGE_96)
  else if (page >= 96U)
  {
    wrp_status = LL_RAMCFG_IsEnabledPageWRP_96_127(RAMCFG_GET_INSTANCE(instance), (1UL << (page - 96U)));
  }
#endif /* LL_RAMCFG_WRP_PAGE_96 */
#if defined (LL_RAMCFG_WRP_PAGE_64)
  else if (page >= 64U)
  {
    wrp_status = LL_RAMCFG_IsEnabledPageWRP_64_95(RAMCFG_GET_INSTANCE(instance), (1UL << (page - 64U)));
  }
#endif /* LL_RAMCFG_WRP_PAGE_64 */
  else
  {
    wrp_status = LL_RAMCFG_IsEnabledPageWRP_32_63(RAMCFG_GET_INSTANCE(instance), (1UL << (page - 32U)));
  }
#endif /* LL_RAMCFG_WRP_PAGE_32 */

  return ((wrp_status == 0U) ? HAL_RAMCFG_WRP_PAGE_NOT_PROTECTED : HAL_RAMCFG_WRP_PAGE_PROTECTED);
}
/**
  * @}
  */

/** @addtogroup RAMCFG_Exported_Functions_Group4
  * @{
This section provides a function that performs a hardware erase of a given SRAM.

- Call the function HAL_RAMCFG_MassErase() to perform a hardware mass erase of the given SRAM. Once erased,
  the SRAM content is zero.
  */

/**
  * @brief  Launch a mass erase for the given SRAM.
  * @param  instance RAMCFG instance.
  * @param  timeout  User timeout to finish the mass erase.
  * @retval HAL_TIMEOUT In case of user timeout.
  * @retval HAL_OK      SRAM is successfully erased.
  */

hal_status_t HAL_RAMCFG_MassErase(hal_ramcfg_t instance, uint32_t timeout)
{
  uint32_t tickstart = HAL_GetTick();

  ASSERT_DBG_PARAM(IS_RAMCFG_MASS_ERASE_INSTANCE(RAMCFG_GET_INSTANCE(instance)));

  LL_RAMCFG_SetEraseKey(RAMCFG_GET_INSTANCE(instance), LL_RAMCFG_ERASE_KEY_1);
  LL_RAMCFG_SetEraseKey(RAMCFG_GET_INSTANCE(instance), LL_RAMCFG_ERASE_KEY_2);
  LL_RAMCFG_EnableSRAMErase(RAMCFG_GET_INSTANCE(instance));
  /* Wait for the SRAM hardware erase operation to complete by polling the SRAMBUSY flag until it resets. */
  while (LL_RAMCFG_IsActiveFlag_SRAMBUSY(RAMCFG_GET_INSTANCE(instance)) != 0U)
  {
    if ((HAL_GetTick() - tickstart) > timeout)
    {
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup RAMCFG_Exported_Functions_Group5
  * @{

This section provides functions to handle RAMCFG interrupts and register callbacks.
- Call the function HAL_RAMCFG_IRQHandler() within the RAMCFG vector to handle any RAMCFG interrupt. Execute this API
 in handler mode.
- Call the function HAL_RAMCFG_NMI_IRQHandler() within the NMI vector to handle the NMI interrupt. Execute this API
 in handler mode.
- Call the function HAL_RAMCFG_ECC_ErrorCallback() to register the RAMCFG single or double error detect callback.
  */

/**
  * @brief  Handle RAMCFG interrupt request.
  * @param  instance RAMCFG instance.
  */
void HAL_RAMCFG_IRQHandler(hal_ramcfg_t instance)
{
  uint32_t flags;

  ASSERT_DBG_PARAM(IS_RAMCFG_ECC_INSTANCE(RAMCFG_GET_INSTANCE(instance)));

  flags = LL_RAMCFG_ReadFlag(RAMCFG_GET_INSTANCE(instance), LL_RAMCFG_FLAG_ECC_ALL);

  /* Double Error Interrupt Management */
  if ((LL_RAMCFG_IsEnabledIT_DE(RAMCFG_GET_INSTANCE(instance)) != 0U) && ((flags & LL_RAMCFG_IT_DE) != 0U))
  {
    (void) HAL_RAMCFG_ECC_ErrorCallback(instance);
    LL_RAMCFG_ClearFlag_DED(RAMCFG_GET_INSTANCE(instance));
  }

  /* Single Error Interrupt Management */
  if ((LL_RAMCFG_IsEnabledIT_SE(RAMCFG_GET_INSTANCE(instance)) != 0U) && ((flags & LL_RAMCFG_IT_SE) != 0U))
  {
    (void) HAL_RAMCFG_ECC_ErrorCallback(instance);
    LL_RAMCFG_ClearFlag_SEDC(RAMCFG_GET_INSTANCE(instance));
  }
}

/**
  * @brief  Handle RAMCFG NMI interrupt request.
  * @param  instance  RAMCFG instance.
  * @retval HAL_OK    when the NMI has been specifically treated by this IRQHandler.
  * @retval HAL_ERROR otherwise.
  */
hal_status_t HAL_RAMCFG_NMI_IRQHandler(hal_ramcfg_t instance)
{
  hal_status_t cb_status = HAL_ERROR;
  uint32_t flags;

  ASSERT_DBG_PARAM(IS_RAMCFG_ECC_INSTANCE(RAMCFG_GET_INSTANCE(instance)));

  flags = LL_RAMCFG_ReadFlag(RAMCFG_GET_INSTANCE(instance), LL_RAMCFG_FLAG_DED);

  /* Double error redirected to NMI interrupt Management */
  if ((LL_RAMCFG_IsEnabledIT_NMI(RAMCFG_GET_INSTANCE(instance)) != 0U) && (flags != 0U))
  {
    /* ECC flag is only cleared if the callback returns HAL_OK,
       that is, if the NMI is specifically handled in the callback. */
    if (HAL_RAMCFG_ECC_ErrorCallback(instance) == HAL_OK)
    {
      LL_RAMCFG_ClearFlag_DED(RAMCFG_GET_INSTANCE(instance));
      cb_status = HAL_OK;
    }
  }

  return cb_status;
}

/**
  * @brief  RAMCFG single or double error detection callback.
  * @param  instance  RAMCFG instance.
  * @retval HAL_ERROR when the NMI has not been treated by the callback.
  */
__WEAK hal_status_t HAL_RAMCFG_ECC_ErrorCallback(hal_ramcfg_t instance)
{
  /* Prevent unused argument compilation warnings. */
  STM32_UNUSED(instance);

  /* Note: Do not modify this function. When the callback is needed,
           implement HAL_RAMCFG_ECC_ErrorCallback in the user file.  */

  return HAL_ERROR;
}

/**
  * @}
  */

/** @addtogroup RAMCFG_Exported_Functions_Group6
  * @{
This section provides functions to get RAMCFG instance information.
- Call the function HAL_RAMCFG_GetLLInstance() to get the selected RAMCFG hardware instance.
- Call the function HAL_RAMCFG_GetSRAMBaseAddress() to get the selected RAMCFG SRAM base address.
- Call the function HAL_RAMCFG_GetSRAMSize() to get the selected RAMCFG SRAM size.
  */
/**
  * @brief  Get the selected hardware RAMCFG instance.
  * @param  instance RAMCFG instance.
  * @retval The selected hardware RAMCFG instance.
  */
RAMCFG_TypeDef *HAL_RAMCFG_GetLLInstance(hal_ramcfg_t instance)
{
  ASSERT_DBG_PARAM(IS_RAMCFG_ALL_INSTANCE(RAMCFG_GET_INSTANCE(instance)));

  return ((RAMCFG_TypeDef *)((uint32_t)(instance)));
}

/**
  * @brief  Get the RAMCFG SRAM base address.
  * @param  instance RAMCFG instance.
  * @retval uint32_t The base address of the given SRAM.
  */
uint32_t HAL_RAMCFG_GetSRAMBaseAddress(hal_ramcfg_t instance)
{
  ASSERT_DBG_PARAM(IS_RAMCFG_ALL_INSTANCE(RAMCFG_GET_INSTANCE(instance)));

  return RAMCFG_GET_SRAM_BASE_ADDR(instance);
}

/**
  * @brief  Get the RAMCFG SRAM size in bytes.
  * @param  instance RAMCFG instance.
  * @retval uint32_t The size of the given SRAM in bytes.
  */
uint32_t HAL_RAMCFG_GetSRAMSize(hal_ramcfg_t instance)
{
  ASSERT_DBG_PARAM(IS_RAMCFG_ALL_INSTANCE(RAMCFG_GET_INSTANCE(instance)));

  return RAMCFG_GET_SRAM_SIZE_BYTE(instance);
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_RAMCFG_MODULE */
#endif /* RAMCFG_SRAM1 || RAMCFG_SRAM2 */

/**
  * @}
  */
